repositories/PersonRepository.php

    public function getSortedPersons(?string $search = null, ?string $order = 'id')
    {
        $orderModeIsAsc = (false === stristr($order, '-'));
        $orderDefaultField = 'id';
        $orderMode = SORT_DESC;
        if ($orderModeIsAsc) {
            $orderMode = SORT_ASC;
        } else {
            //delete a first symbol "-" from a field name, when sorting direction is "DESC"
            $order = substr($order, 1);
        }

        // Array, which describes a model fields to sorting. As i understand, i can use array_keys($model->attributes), or like this. But i don't have many time to fully understand Yii :-)
        $allowedFields = [
            'id', 'firstName', 'lastName',
        ];

        $order = in_array($order, $allowedFields) ? $order : $orderDefaultField;

        $persons = Person::find()
        ->with('phones');
---
SELECT * FROM `persons` ORDER BY `id`